# Завдання 2
# У вас є текстовий файл, який містить інформацію про котів. Кожен рядок 
# файлу містить унікальний ідентифікатор кота, його ім'я та вік, розділені комою. 
# Ваше завдання - розробити функцію get_cats_info(path), яка читає цей файл та повертає 
# список словників з інформацією про кожного кота.


# Функція get_cats_info(path) має приймати один аргумент - шлях до текстового файлу (path).
# Файл містить дані про котів, де кожен запис містить унікальний ідентифікатор, ім'я кота та його вік.
# Функція має повертати список словників, де кожен словник містить інформацію про одного кота.

from data import load_data, convert_data

def get_cats_info(path : str) -> list[dict] :
    raw_data = load_data(path)
    return (convert_data(raw_data))


def main() :
    cats_info = get_cats_info("task_2/cats_info.txt")
    print(cats_info)

if __name__ == "__main__":
    main()